tap 'nektos/tap'
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'windmilleng/tap'
tap 'd12frosted/emacs-plus'

cask_args appdir: '~/Applications'

# Command runner
brew 'just'

brew 'windmilleng/tap/tilt'
brew 'docker-machine-driver-hyperkit'
brew 'qemu' # for running qcow2 based vms
brew 'socat' # for creating screen accessible sockets for virtualbox

brew 'mkcert' # local trusted development certificates
brew 'nss' # using locally trusted certificates

brew 'kustomize' # for building/handling/changing kubernetes manifests

brew 'buildifier'

brew 'exiftool' # show/mutate EXIF information of documents
brew 'pstree' # show parent/child relationship of processes

brew 'git'
brew 'svn' # necessary for pull in fonts
brew 'git-crypt'

brew 'mas' # cli tool to install Apple App Store apps
brew 'redis'

brew 'qcachegrind' # for reading calltree/valgrind outputted profiles

brew 'mr' # myrepos tool to manage large number of repositories at the same time

brew 'rcm' # tool for managing dotfiles

brew 'gcc' # To be able to compile libv8 with libc++
brew 'pkg-config' # Helper tool for compiling applications
brew 'imagemagick' # otherwise Rails image upload no work

brew 'dnsmasq'
brew 'cdrtools' # contains mkisofs for making cloud-init images
brew 'hyperkit' # running virtual machines on macos for testing
brew 'hivemind' # for running multiple virtual machines from procfile
brew 'dnsmasq' # for custom DNS / DHCP
brew 'dhcping' # for debugging DHCP responses

brew 'overmind' # for running services in a procfile in the background

brew 'nektos/tap/act'

# Networking tools
brew 'nmap'
brew 'iperf'

# For generating and reading graphs using `dot` tool
brew 'graphviz'

# Git tool to rewrite/remove git history
brew 'git-filter-repo'

cask 'microsoft-teams' # for video calling
cask 'graphiql' # for running GraphQL queries against any GraphQL endpoint
cask 'docker'
cask 'vagrant' # Vagrant enables users to create and configure lightweight, reproducible, and portable development environments.
cask 'spotify'
cask 'telegram'
cask 'whatsapp'
cask 'resilio-sync'
cask 'viscosity'
cask 'multipass'
cask 'amethyst'
cask 'ngrok'
cask 'figma' ## tool for sharing designs and workflows
cask 'notion'

cask 'vlc'

# First install of virtualbox will always fail because system extensions need to be approved
cask 'virtualbox'
cask 'intel-haxm' # hardware accelerator for qemu

cask 'plex'


cask 'brave-browser'
cask '1password-cli'
cask 'steam'
# New type of terminal
cask 'warp'
cask 'iterm2', args: { force: true }
cask 'rubymine'
cask 'sublime-text'
cask 'adobe-creative-cloud'
cask 'alfred' # advanced alternative to macos spotlight
cask 'postman' # for doing API calls
cask 'balenaetcher' # utility for flashing disk images to sd card for raspberry pi

cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-menlo-for-powerline'
cask 'font-fira-mono'

if ENV.fetch('CI', 'false') == 'false'
  mas 'Todoist: To-Do List & Tasks', id: 585_829_637
  mas 'UPRIGHT GO Desktop', id: 1_404_231_964
end
